{
  "cache": {
    "0ca828eb47ea11b9a4075f94b75ec599": {
      "original_text": "Chapter 2: The Brainless Female Protagonist, Ye Qingcheng’s Astonishment!",
      "translation": "Глава 2: Безмозглая женщина-протагонист, изумление Е Цинчэна!",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:05.055051",
      "text_length": 73
    },
    "50bd552b590adcf8799b6cca61a4e29d": {
      "original_text": "“Jiang Chen, I’ve told you many times already!”",
      "translation": "\"Цзян Чэнь, я уже много раз говорил тебе об этом!\"",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:05.924650",
      "text_length": 47
    },
    "31ca5bef2907d1d7ad17fee127388e36": {
      "original_text": "“Stop sending me things in the future, I hope this is the last time I have to say it!” Ye Qingcheng spoke coldly, with a hint of disdain. She had always believed Jiang Chen was her enemy, so she had been indifferent to him all this time!",
      "translation": "\"Не присылайте мне ничего в будущем, надеюсь, это последний раз, когда мне приходится это говорить!\" Е Цинчэн говорила холодно, с оттенком презрения. Она всегда считала Цзян Чэня своим врагом, поэтому все это время была к нему равнодушна!",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:06.800492",
      "text_length": 237
    },
    "cbee770e209564cfecf496ec23b96faa": {
      "original_text": "After joining the Primordial Holy Land, Ye Qingcheng had been diligently cultivating. Her goal was to one day kill Jiang Chen and avenge her slaughtered family!",
      "translation": "После вступления в Изначальную Святую Землю Е Цинчэн усердно занималась культивированием. Ее целью было однажды убить Цзян Чэня и отомстить за свою убитую семью!",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:07.676774",
      "text_length": 160
    },
    "63bad8443da1e79ef9b2bc9f5e321562": {
      "original_text": "Without absolute strength, Ye Qingcheng had no intention of interacting with Jiang Chen. However, Jiang Chen, being a dog licker, would send her gifts from time to time. This annoyed Ye Qingcheng to no end!",
      "translation": "Не имея абсолютной силы, Е Цинчэн не собиралась общаться с Цзян Чэнем. Однако Цзян Чэнь, будучи собачьим лизоблюдом, время от времени присылал ей подарки. Это раздражало Е Цинчэн до крайности!",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:08.592790",
      "text_length": 206
    },
    "669187796ff4c3e841bb1c9b60ac77b4": {
      "original_text": "Hearing this, Jiang Chen paused, suddenly remembering that he had indeed sent Ye Qingcheng a heavenly treasure not long ago. A Thousand-Year Snow Lotus, an extremely rare heavenly treasure.",
      "translation": "Услышав это, Цзян Чэнь приостановился, внезапно вспомнив, что не так давно он действительно посылал Е Цинчэну небесное сокровище. Тысячелетний Снежный Лотос, чрезвычайно редкое небесное сокровище.",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:09.813571",
      "text_length": 189
    },
    "93ee2f36dc498048de91e2f0b02983c3": {
      "original_text": "Such a treasure was beneficial for Ye Qingcheng’s cultivation, and the original Jiang Chen had hurriedly sent it to her. However, he was met with a closed door and didn’t see Ye Qingcheng. The gift was sent, though.",
      "translation": "Такое сокровище было полезно для культивации Е Цинчэн, и первый Цзян Чэнь поспешил отправить его ей. Однако его встретила закрытая дверь, и он не увидел Е Цинчэн. Однако подарок был отправлен.",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:10.675441",
      "text_length": 215
    },
    "c111b6094c647ba69f96a8e23e954ac5": {
      "original_text": "“If Junior Sister Ye doesn’t like it, then return the Thousand-Year Snow Lotus,” Jiang Chen said with a faint smile. He was no longer the dog licker from before and wouldn’t bother with Ye Qingcheng. Moreover, the Thousand-Year Snow Lotus was a rare treasure that could be useful for his cultivation in the future!",
      "translation": "\"Если младшей сестре Е это не нравится, то верните Тысячелетний Снежный Лотос\", - сказал Цзян Чэнь со слабой улыбкой. Он уже не был прежним собачьим лизоблюдом и не собирался беспокоить Е Цинчэн. Кроме того, Тысячелетний Снежный Лотос был редким сокровищем, которое могло пригодиться ему в будущем!",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:11.647812",
      "text_length": 314
    },
    "b6f3e87b33ed590d9286bac7eb071c61": {
      "original_text": "Hearing this, Ye Qingcheng was stunned, seemingly not expecting Jiang Chen to say this. Because the Jiang Chen of the past had never asked for anything back from Ye Qingcheng. This was a first.",
      "translation": "Услышав это, Е Цинчэн был ошеломлен, похоже, не ожидая, что Цзян Чэнь скажет такое. Ведь тот Цзян Чэнь, что был раньше, никогда не просил ничего взамен у Е Цинчэна. Это было впервые.",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:12.647995",
      "text_length": 193
    },
    "f5a09257f42bf55671fcb4274d63d43c": {
      "original_text": "Meanwhile, a strange voice once again rose,",
      "translation": "Тем временем снова раздался странный голос,",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:13.696848",
      "text_length": 43
    },
    "25f398a8421426aa3f1ff1a86645da27": {
      "original_text": "“It’s better not to!”",
      "translation": "\"Лучше не надо!\"",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:14.577336",
      "text_length": 21
    },
    "d46cc4cc88eec9539edb32d5b07e4b7d": {
      "original_text": "‘How did I even fall for such a brainless woman in the past! Why was I so concerned about her!’",
      "translation": "Как я вообще влюбился в такую безмозглую женщину! Почему я так беспокоился о ней!",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:15.479058",
      "text_length": 95
    },
    "03d085bfde57f9d3d67025e03758db04": {
      "original_text": "‘I shouldn’t have saved her back then. Not only did she not repay the favor, but she also turned against me, joining hands with Du Guyun to kill me!’",
      "translation": "Зря я ее тогда спас. Она не только не отплатила мне добром, но и обернулась против меня, объединившись с Ду Гуюном, чтобы убить меня!",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:16.361420",
      "text_length": 149
    },
    "7b7336957a9551d25be3b373977dc90a": {
      "original_text": "‘What a brainless ingrate!’",
      "translation": "\"Какой безмозглый неблагодарный!",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:17.199513",
      "text_length": 27
    },
    "0df66d3a50a857b106586e1bc1f55c48": {
      "original_text": "‘This woman is perfect in every aspect, except for her brain. Knowing that the Ye family was killed by Du Guyun’s father, she was easily fooled by Du Guyun’s words about not extending the hatred of the previous generation to the next, and happily got together with him!’",
      "translation": "Эта женщина идеальна во всех отношениях, кроме мозгов. Зная, что семья Е была убита отцом Ду Гуюна, она легко обманулась словами Ду Гуюна о том, что нельзя распространять ненависть предыдущего поколения на следующее, и с радостью сошлась с ним!",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:18.312952",
      "text_length": 270
    },
    "ebfda38b16c1351dfefa224ecef3bb27": {
      "original_text": "‘If I were a member of the Ye family, I’d be turning in my grave!’ Jiang Chen silently criticized in his heart.’",
      "translation": "\"Если бы я был членом семьи Е, я бы в гробу перевернулся! Цзян Чэнь тихо выругался в сердцах.",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:19.203280",
      "text_length": 112
    },
    "e1b90b8415cc1214506da86a1ce202e0": {
      "original_text": "He had no good feelings for this so-called female protagonist, Ye Qingcheng. Not just because of the subsequent plot developments. But also because Ye Qingcheng’s intelligence was really questionable, especially when it came to matters related to Du Guyun, her IQ instantly dropped to zero.",
      "translation": "Он не испытывал никаких добрых чувств к этой так называемой главной героине, Е Цинчэн. И не только из-за последующего развития сюжета. Но и потому, что интеллект Е Цинчэн был весьма сомнительным, особенно когда дело касалось Ду Гуюна, ее IQ мгновенно падал до нуля.",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:20.099631",
      "text_length": 290
    },
    "a411d2f3bd47c7ba1539d6078200510d": {
      "original_text": "‘Damn Jiang Chen! Actually, in his heart, he’s cursing me as a brainless ingrate!’",
      "translation": "'Проклятый Цзян Чэнь! На самом деле, в глубине души он проклинает меня как безмозглого неблагодарного!",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:20.943838",
      "text_length": 82
    },
    "7a19dda0327b70907f08db15c32765b3": {
      "original_text": "‘So in his eyes, this is the kind of person I am! This Jiang Chen is really hypocritical, two-faced!’ Ye Qingcheng felt a complex mix of emotions. Jiang Chen’s inner voice had revealed another side of him. A very real side. One she had never seen before.",
      "translation": "'Значит, в его глазах я именно такой человек! Этот Цзян Чэнь действительно лицемерен и двуличен! Е Цинчэн испытывала сложную смесь эмоций. Внутренний голос Цзян Чэня показал его с другой стороны. Очень реальную сторону. Такого она еще не видела.",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:21.815437",
      "text_length": 254
    },
    "77911d850cf3481a94e74af5af455da2": {
      "original_text": "Even though she didn’t like Jiang Chen in the past, she had to admit that he was a seemingly perfect person. Whether it was his background, cultivation, talent, or appearance, no flaws could be found. Moreover, Jiang Chen’s demeanor was always composed, handling any situation with ease. Such a man would receive great admiration anywhere.",
      "translation": "Несмотря на то, что в прошлом Цзян Чэнь ей не нравился, она должна была признать, что он был идеальным человеком. Будь то его происхождение, уровень развития, талант или внешность, в нем нельзя было найти недостатков. Более того, поведение Цзян Чэня всегда было спокойным, он легко справлялся с любой ситуацией. Такой человек вызывал восхищение в любом месте.",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:22.758321",
      "text_length": 339
    },
    "cc3500dad7b4168d0380d04bf1903eaf": {
      "original_text": "However, Jiang Chen’s exposed inner voice today was like that of a common man, unfiltered and rude. This made Ye Qingcheng feel a bit unreal, as if she was seeing Jiang Chen for the first time. Even though Jiang Chen was cursing her in his heart, Ye Qingcheng’s heart only felt a slight anger.",
      "translation": "Однако сегодня внутренний голос Цзян Чэня был похож на голос обычного человека, нескромный и грубый. Это заставило Е Цинчэн почувствовать себя немного нереальной, как будто она впервые увидела Цзян Чэня. Несмотря на то, что Цзян Чэнь в душе проклинал ее, в сердце Е Цинчэн чувствовался лишь легкий гнев.",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:23.634641",
      "text_length": 293
    },
    "6fa93d189c744658854a7b5b0a93c244": {
      "original_text": "This slight anger was simply because she couldn’t accept Jiang Chen thinking she was brainless!",
      "translation": "Этот легкий гнев был вызван тем, что она не могла смириться с тем, что Цзян Чэнь считает ее безмозглой!",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:24.477837",
      "text_length": 95
    },
    "48fac82400916051532a41804c9dc801": {
      "original_text": "‘But who is Du Guyun? Could it be that my enemy is Du Guyun’s father, not Jiang Chen? This is impossible, I clearly saw Jiang Chen that day, and no one else!’",
      "translation": "Но кто такой Ду Гуюн? Может ли быть так, что мой враг - отец Ду Гуюна, а не Цзян Чэнь? Это невозможно, в тот день я точно видел Цзян Чэня, и никого другого!",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:25.334812",
      "text_length": 158
    },
    "2224d88ae23d541aae6ac26528b06d24": {
      "original_text": "Ye Qingcheng’s will was extremely firm, naturally, she wouldn’t change her mind just because of a few words from Jiang Chen!",
      "translation": "Воля Е Цинчэн была очень твердой, и, естественно, она не изменила бы своего решения только из-за нескольких слов Цзян Чэня!",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:26.207840",
      "text_length": 124
    },
    "2b58c00984f177d776b3ecddb5c081f2": {
      "original_text": "However, these thoughts from Jiang Chen had started to shake her a little. And she felt these voices were indeed Jiang Chen’s thoughts. Only, she didn’t know why she could hear Jiang Chen’s thoughts!",
      "translation": "Однако эти мысли Цзян Чэня немного потрясли ее. Она почувствовала, что эти голоса действительно были мыслями Цзян Чэня. Вот только она не знала, почему слышит мысли Цзян Чэня!",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:27.106313",
      "text_length": 199
    },
    "c354c79ac88df756da4effd0c1aefbcf": {
      "original_text": "“The gifts you sent me in the past, I didn’t touch a single one, they are all here! Now I am returning all these things to you!”",
      "translation": "\"Подарки, которые вы присылали мне в прошлом, я не трогал ни одного, они все здесь! Теперь я возвращаю тебе все эти вещи!\"",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:27.951774",
      "text_length": 128
    },
    "f214cd5c9610beef8feaeb6cd11cfb47": {
      "original_text": "“I hope you will not harass me in the future!” Ye Qingcheng immediately threw out a ring. Inside it were all the gifts Jiang Chen had sent over the years!",
      "translation": "\"Надеюсь, в будущем вы не будете меня донимать!\" Е Цинчэн тут же выбросил кольцо. Внутри него были все подарки, которые Цзян Чэнь присылал на протяжении многих лет!",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:28.755419",
      "text_length": 154
    },
    "e189c2884c291dee55c0967aa2248119": {
      "original_text": "“And who is Du Guyun?” Ye Qingcheng looked at Jiang Chen and said in a deep voice. She was somewhat concerned about Du Guyun, because through Jiang Chen’s thoughts.",
      "translation": "\"А кто такой Ду Гуюн?\" Е Цинчэн посмотрела на Цзян Чэня и сказала глубоким голосом. Она была несколько обеспокоена судьбой Ду Гуюна, потому что в мыслях Цзян Чэня.",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:29.670961",
      "text_length": 164
    },
    "6838fd45eeccf8e558010d1ba4e3202f": {
      "original_text": "Du Guyun turned out to be her future partner and it seemed Jiang Chen knew something!  With Jiang Chen’s change, this made Ye Qingcheng think a lot!",
      "translation": "Ду Гуюн оказался ее будущим партнером, а Цзян Чэнь, похоже, что-то знал!  Перемены в Цзян Чэне заставили Е Цинчэна призадуматься!",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:30.507826",
      "text_length": 148
    },
    "6962ae03bbbb5006558eb4b186932a40": {
      "original_text": "Jiang Chen didn’t hesitate, he collected the space ring and checked it, finding none of the items were missing! “Junior Sister Ye, there’s also the Banished Immortal Peak token!”",
      "translation": "Цзян Чэнь не стал медлить, а взял пространственное кольцо и проверил его, обнаружив, что ни один из предметов не пропал! \"Младшая сестра Е, здесь также есть жетон Запредельного Бессмертного Пика!\"",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:31.353008",
      "text_length": 178
    },
    "310f0327651848c2338dbf3c82345800": {
      "original_text": "“As for Du Guyun, this is the first time I’m hearing about him,” Jiang Chen put away the space ring and revealed a gentle smile, flawless. Only when he heard the name Du Guyun did a hint of doubt and shock flash in his eyes.",
      "translation": "\"Что касается Ду Гуюна, то я впервые слышу о нем\", - Цзян Чэнь убрал пространственное кольцо и улыбнулся мягкой, безупречной улыбкой. Только когда он услышал имя Ду Гуюна, в его глазах промелькнул намек на сомнение и шок.",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:32.218618",
      "text_length": 224
    },
    "b0a389a86c854a956b81024b2c60a6b6": {
      "original_text": "This fleeting look was caught by Ye Qingcheng. ‘Indeed, he is a man of double standards. Still lying. Hmph.’ Ye Qingcheng snorted coldly in her heart, Jiang Chen was still pretending not to know?",
      "translation": "Е Цинчэн поймал этот мимолетный взгляд. 'Действительно, он человек двойных стандартов. И все равно врет. Хмпф. Е Цинчэн холодно фыркнула: Цзян Чэнь все еще притворяется, что не знает?",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:33.151026",
      "text_length": 195
    },
    "023edead4f02dd38a2ba41b0667d68a7": {
      "original_text": "“Here, take it back!” Ye Qingcheng had no intention of keeping the Banished Immortal Peak token. Or rather, she didn’t want anything from Jiang Chen. Now that she could return it, she couldn’t be happier.",
      "translation": "\"Вот, забирай!\" Е Цинчэн не собиралась оставлять себе жетон Пика Запредельного Бессмертия. Вернее, ей вообще ничего не было нужно от Цзян Чэня. Теперь, когда она могла вернуть его, она не могла быть счастливее.",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:34.028251",
      "text_length": 204
    },
    "3488ee441b4d5f4e01ee9c432a78e2e9": {
      "original_text": "‘Why is she asking about Du Guyun? According to the plot, shouldn’t she be meeting Du Guyun three days later? And it’s this encounter that lets Du Guyun completely enter Ye Qingcheng’s heart!’",
      "translation": "Почему она спрашивает о Ду Гуюне? По сюжету, она должна была встретиться с Ду Гуюном через три дня? И именно эта встреча позволит Ду Гуюну полностью войти в сердце Е Цинчэна!",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:35.015618",
      "text_length": 192
    },
    "e11f5ae95c75c54a4d82d76825bc08a6": {
      "original_text": "‘But this brainless woman never thought that this so-called encounter was a carefully planned scheme by Du Guyun!’",
      "translation": "Но этой безмозглой женщине и в голову не пришло, что эта так называемая встреча была тщательно спланирована Ду Гуюном!",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:35.847272",
      "text_length": 114
    },
    "1408bf08b74315017c2dec20c9f9851a": {
      "original_text": "‘Who knows where Du Guyun got the information from, knowing Ye Qingcheng would go to the Cangmang Mountain Range for training, he provoked the beasts there, putting the brainless woman in danger, and then Du Guyun played the hero, though he was not strong enough, he got severely injured trying to save Ye Qingcheng!’",
      "translation": "Кто знает, откуда Ду Гуюн получил информацию: зная, что Е Цинчэн отправится на тренировку в хребет Цанман, он спровоцировал зверей, подвергнув безмозглую женщину опасности, а Ду Гуюн сыграл роль героя, хотя и не был достаточно силен, он получил тяжелые ранения, пытаясь спасти Е Цинчэн!",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:37.013627",
      "text_length": 317
    },
    "cb522ca4a67c4da0285cb5ea1ddeb4e4": {
      "original_text": "‘Because of this act, Ye Qingcheng developed some feelings! But this brainless woman will never know that the initial heroic rescue was just Du Guyun’s plan!’",
      "translation": "Из-за этого поступка у Е Цинчэна появились какие-то чувства! Но эта безмозглая женщина никогда не узнает, что первоначальное героическое спасение было лишь планом Ду Гуюна!",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:37.872472",
      "text_length": 158
    },
    "8712341ddee9e1672c81531395ff05b3": {
      "original_text": "‘Oh well, knowing it or not doesn’t matter, this brainless woman would forgive Du Guyun! After all, if she can give up the vengeance for the extermination of her clan, what’s a mere deception? She really is brainless!’",
      "translation": "Ну что ж, знать это или нет - неважно, эта безмозглая женщина простит Ду Гуюна! Ведь если она может отказаться от мести за истребление своего клана, то что такое простой обман? Она действительно безмозглая!",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:38.720004",
      "text_length": 218
    },
    "e93a93a9b6d4220984410e1e42ba17e9": {
      "original_text": "Ye Qingcheng felt like slapping Jiang Chen.",
      "translation": "Е Цинчэну захотелось дать Цзян Чэню пощечину.",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:39.551984",
      "text_length": 43
    },
    "384439f063635956d923e89b073b53d6": {
      "original_text": "Left and right, calling her brainless, made Ye Qingcheng extremely annoyed. Was she the kind of woman with looks but no brains? Not to mention such a crude scheme, she could see right through it.",
      "translation": "Налево и направо называя ее безмозглой, Е Цинчэн была крайне раздражена. Неужели она была из тех женщин, у которых есть внешность, но нет мозгов? Не говоря уже о такой грубой схеме, она видела ее насквозь.",
      "source_lang": "EN",
      "target_lang": "RU",
      "timestamp": "2025-09-15T10:13:40.419278",
      "text_length": 195
    }
  },
  "metadata": {
    "last_updated": "2025-09-15T10:13:40.419278",
    "stats": {
      "hits": 0,
      "misses": 40,
      "total_requests": 40,
      "cache_size": 40
    }
  }
}